{"steps": {"0": "START", "294": "Whisk-Whisk batter until no lumps remain", "295": "remove-then carefully remove the paper liner", "296": "Measure and add-2 tbsp water to the bowl", "297": "Measure and add-1.5 tbsp sugar to the mixing bowl", "298": "Scoop-While the cake is cooling, prepare to pipe the frosting. Scoop 4 spoonfuls of chocolate frosting into a zip-top bag", "299": "Measure and add-Measure and add 2 tbsp flour to the mixing bowl", "300": "Measure and add-Measure and add 2 tsp vegetable oil to the bowl", "301": "Set-Set aside the lined mug", "302": "Squeeze-Squeeze the frosting through the opening to apply small dollops of frosting to the plate in a circle around the base of the cake", "303": "Place-Place the paper cupcake liner inside the mug", "304": "Measure and add-1/4 tsp baking powder to the bowl", "305": "Allow-Allow to cool until it is no longer hot to the touch", "306": "cut-Use scissors to cut one corner from the bag to create a small opening 1/4 inch in diameter", "307": "Pour-Pour batter into prepared mug", "308": "Whisk-Whisk to combine mixture of flour, sugar and baking powder in the bowl", "309": "Invert-Invert the mug to release the cake onto a plate", "310": "Measure and add-a pinch of salt to the mixing bowl", "311": "seal-seal zip top bag, removing as much air as possible", "312": "Microwave-Microwave the mug and batter on high power for 60 seconds. Check if the cake is done by inserting and toothpick into the center of the cake and then removing it. If wet batter clings to the toothpick, microwave for an additional 5 seconds. If the toothpick comes out clean, continue", "313": "Measure and add-1/4 tsp vanilla extract to the bowl", "1000": "END"}, "edges": [[296, 294], [313, 294], [300, 294], [305, 295], [308, 296], [295, 298], [308, 300], [303, 301], [306, 302], [309, 305], [311, 306], [294, 307], [301, 307], [310, 308], [299, 308], [304, 308], [297, 308], [312, 309], [298, 311], [307, 312], [308, 313], [0, 297], [0, 299], [0, 303], [0, 304], [0, 310], [302, 1000]]}